Revit 2027 API
BuiltInFailures.FamilyFailures.CantPlaceATOnDuctError Property
 The air terminal cannot be placed in an elevation or section view unless it is attached to a duct.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CantPlaceATOnDuctError { get; }
Public Shared ReadOnly Property CantPlaceATOnDuctError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CantPlaceATOnDuctError {
	FailureDefinitionId^ get ();
}
static member CantPlaceATOnDuctError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace